app/views/students/edit.html.erb

SELECT "schools".* FROM "schools"
---
    <%= t.number_field :age %>
    <%= t.collection_select :school_id, School.all, :id, :name %>