app/views/students/new.html.erb

    <%= t.number_field :age %>
    <%= t.collection_select :school_id, School.all, :id, :name %>
---
SELECT "schools".* FROM "schools"