app/controllers/schools_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @school = School.find_by_id(params[:id])