app/controllers/students_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @student = Student.new
    @schools = School.all

INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Filip Todoroski"], ["age", 22], ["created_at", "2020-02-03 18:11:56.749248"], ["updated_at", "2020-02-03 18:11:56.749248"], ["school_id", 11]]
---
  def create
     @student = Student.create!(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    student = Student.find_by_id(params[:id])
    student.destroy